## 🏗️ Terraform Plan

<details>
<summary>📋 Plan Output</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_ssm_parameter.db_endpoint will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ssm_parameter" "db_endpoint"  {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/cloudpro-vpc/rds/endpoint"
      + region         = (known after apply)
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # data.aws_ssm_parameter.db_password will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ssm_parameter" "db_password"  {
      + arn             = (known after apply)
      + id              = (known after apply)
      + insecure_value  = (known after apply)
      + name            = "/cloudpro-vpc/rds/password"
      + region          = (known after apply)
      + type            = (known after apply)
      + value           = (sensitive value)
      + version         = (known after apply)
      + with_decryption = true
    }

  # data.aws_ssm_parameter.db_username will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ssm_parameter" "db_username"  {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/cloudpro-vpc/rds/username"
      + region         = (known after apply)
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_autoscaling_group.wordpress will be created
  + resource "aws_autoscaling_group" "wordpress" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + enabled_metrics                  = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupTotalInstances",
        ]
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "cloudpro-vpc-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + region                           = "us-east-1"
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = [
          + "OldestInstance",
        ]
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution {
          + capacity_distribution_strategy = (known after apply)
        }

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_ids                 = (known after apply)
              + capacity_reservation_resource_group_arns = (known after apply)
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = (known after apply)
              + on_demand_percentage_above_base_capacity = (known after apply)
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
              + spot_max_price                           = (known after apply)
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type     = (known after apply)
                  + weighted_capacity = (known after apply)

                  + instance_requirements {
                      + accelerator_manufacturers                               = (known after apply)
                      + accelerator_names                                       = (known after apply)
                      + accelerator_types                                       = (known after apply)
                      + allowed_instance_types                                  = (known after apply)
                      + bare_metal                                              = (known after apply)
                      + burstable_performance                                   = (known after apply)
                      + cpu_manufacturers                                       = (known after apply)
                      + excluded_instance_types                                 = (known after apply)
                      + instance_generations                                    = (known after apply)
                      + local_storage                                           = (known after apply)
                      + local_storage_types                                     = (known after apply)
                      + max_spot_price_as_percentage_of_optimal_on_demand_price = (known after apply)
                      + on_demand_max_price_percentage_over_lowest_price        = (known after apply)
                      + require_hibernate_support                               = (known after apply)
                      + spot_max_price_percentage_over_lowest_price             = (known after apply)

                      + accelerator_count {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + accelerator_total_memory_mib {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + baseline_ebs_bandwidth_mbps {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + memory_gib_per_vcpu {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + memory_mib {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + network_bandwidth_gbps {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + network_interface_count {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + total_local_storage_gb {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + vcpu_count {
                          + max = (known after apply)
                          + min = (known after apply)
                        }
                    }

                  + launch_template_specification {
                      + launch_template_id   = (known after apply)
                      + launch_template_name = (known after apply)
                      + version              = (known after apply)
                    }
                }
            }
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "prod"
        }
      + tag {
          + key                 = "ManagedBy"
          + propagate_at_launch = true
          + value               = "AutoScaling"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = false
          + value               = "cloudpro-vpc-asg"
        }
      + tag {
          + key                 = "Project"
          + propagate_at_launch = true
          + value               = "cloudpro-vpc"
        }

      + traffic_source {
          + identifier = (known after apply)
          + type       = (known after apply)
        }
    }

  # aws_autoscaling_policy.scale_down will be created
  + resource "aws_autoscaling_policy" "scale_down" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "cloudpro-vpc-asg"
      + cooldown                = 300
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "cloudpro-vpc-scale-down"
      + policy_type             = "SimpleScaling"
      + region                  = "us-east-1"
      + scaling_adjustment      = -1
    }

  # aws_autoscaling_policy.scale_up will be created
  + resource "aws_autoscaling_policy" "scale_up" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "cloudpro-vpc-asg"
      + cooldown                = 300
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "cloudpro-vpc-scale-up"
      + policy_type             = "SimpleScaling"
      + region                  = "us-east-1"
      + scaling_adjustment      = 1
    }

  # aws_cloudwatch_metric_alarm.cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors ec2 cpu utilization for scale up"
      + alarm_name                            = "cloudpro-vpc-cpu-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "cloudpro-vpc-asg"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 120
      + region                                = "us-east-1"
      + statistic                             = "Average"
      + tags                                  = {
          + "Name" = "cloudpro-vpc-cpu-high-alarm"
        }
      + tags_all                              = {
          + "Name" = "cloudpro-vpc-cpu-high-alarm"
        }
      + threshold                             = 70
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.cpu_low will be created
  + resource "aws_cloudwatch_metric_alarm" "cpu_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors ec2 cpu utilization for scale down"
      + alarm_name                            = "cloudpro-vpc-cpu-low"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "cloudpro-vpc-asg"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 120
      + region                                = "us-east-1"
      + statistic                             = "Average"
      + tags                                  = {
          + "Name" = "cloudpro-vpc-cpu-low-alarm"
        }
      + tags_all                              = {
          + "Name" = "cloudpro-vpc-cpu-low-alarm"
        }
      + threshold                             = 30
      + treat_missing_data                    = "missing"
    }

  # aws_db_instance.wordpress will be created
  + resource "aws_db_instance" "wordpress" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 0
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "wordpress"
      + db_subnet_group_name                  = "cloudpro-vpc-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0.44"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "cloudpro-vpc-mysql"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "sun:04:00-sun:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + region                                = "us-east-1"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc-mysql"
        }
      + tags_all                              = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc-mysql"
        }
      + timezone                              = (known after apply)
      + upgrade_rollout_order                 = (known after apply)
      + username                              = (sensitive)
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "cloudpro-vpc-db-subnet-group"
      + name_prefix             = (known after apply)
      + region                  = "us-east-1"
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc DB subnet group"
        }
      + tags_all                = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc DB subnet group"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_eip.eip[0] will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Name" = "cloudpro-vpc-us-east-1a"
        }
      + tags_all             = {
          + "Name" = "cloudpro-vpc-us-east-1a"
        }
    }

  # aws_iam_instance_profile.wordpress_ssm will be created
  + resource "aws_iam_instance_profile" "wordpress_ssm" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "cloudpro-vpc-wordpress-ssm-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Name" = "cloudpro-vpc-wordpress-ssm-profile"
        }
      + tags_all    = {
          + "Name" = "cloudpro-vpc-wordpress-ssm-profile"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.rds_monitoring will be created
  + resource "aws_iam_role" "rds_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudpro-vpc-rds-monitoring-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc-rds-monitoring-role"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc-rds-monitoring-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.wordpress_ssm will be created
  + resource "aws_iam_role" "wordpress_ssm" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "cloudpro-vpc-wordpress-ssm-"
      + path                  = "/"
      + tags                  = {
          + "Name" = "cloudpro-vpc-wordpress-ssm-role"
        }
      + tags_all              = {
          + "Name" = "cloudpro-vpc-wordpress-ssm-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.wordpress_ssm_parameters will be created
  + resource "aws_iam_role_policy" "wordpress_ssm_parameters" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "cloudpro-vpc-ssm-parameters-"
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.rds_monitoring will be created
  + resource "aws_iam_role_policy_attachment" "rds_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "cloudpro-vpc-rds-monitoring-role"
    }

  # aws_iam_role_policy_attachment.wordpress_ssm will be created
  + resource "aws_iam_role_policy_attachment" "wordpress_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags     = {
          + "Name" = "cloudpro-vpc-igw"
        }
      + tags_all = {
          + "Name" = "cloudpro-vpc-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.wordpress will be created
  + resource "aws_launch_template" "wordpress" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Launch template para instancias WordPress do ASG"
      + ebs_optimized          = "true"
      + id                     = (known after apply)
      + image_id               = "ami-0fcb14c72c80bdef2"
      + instance_type          = "t3.micro"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "cloudpro-vpc-wordpress-"
      + region                 = "us-east-1"
      + tags                   = {
          + "Name" = "cloudpro-vpc-launch-template"
        }
      + tags_all               = {
          + "Name" = "cloudpro-vpc-launch-template"
        }
      + user_data              = "IyEvYmluL2Jhc2gKIyBCdXNjYXIgY3JlZGVuY2lhaXMgZSBlbmRwb2ludCBkbyBTU00gUGFyYW1ldGVyIFN0b3JlCmRiX3VzZXJuYW1lPSQoYXdzIHNzbSBnZXQtcGFyYW1ldGVyIC0tbmFtZSAiL2Nsb3VkcHJvLXZwYy9yZHMvdXNlcm5hbWUiIC0tcmVnaW9uIHVzLWVhc3QtMSAtLXF1ZXJ5ICdQYXJhbWV0ZXIuVmFsdWUnIC0tb3V0cHV0IHRleHQpCmRiX3VzZXJfcGFzc3dvcmQ9JChhd3Mgc3NtIGdldC1wYXJhbWV0ZXIgLS1uYW1lICIvY2xvdWRwcm8tdnBjL3Jkcy9wYXNzd29yZCIgLS1yZWdpb24gdXMtZWFzdC0xIC0td2l0aC1kZWNyeXB0aW9uIC0tcXVlcnkgJ1BhcmFtZXRlci5WYWx1ZScgLS1vdXRwdXQgdGV4dCkKZGJfZW5kcG9pbnQ9JChhd3Mgc3NtIGdldC1wYXJhbWV0ZXIgLS1uYW1lICIvY2xvdWRwcm8tdnBjL3Jkcy9lbmRwb2ludCIgLS1yZWdpb24gdXMtZWFzdC0xIC0tcXVlcnkgJ1BhcmFtZXRlci5WYWx1ZScgLS1vdXRwdXQgdGV4dCkKZGJfbmFtZT13b3JkcHJlc3MKeXVtIHVwZGF0ZSAteQp5dW0gaW5zdGFsbCAteSBodHRwZAp5dW0gaW5zdGFsbCAteSBteXNxbAphbWF6b24tbGludXgtZXh0cmFzIGVuYWJsZSBwaHA3LjQKeXVtIGNsZWFuIG1ldGFkYXRhCnl1bSBpbnN0YWxsIC15IHBocCBwaHAte3BlYXIsY2dpLGNvbW1vbixjdXJsLG1ic3RyaW5nLGdkLG15c3FsbmQsZ2V0dGV4dCxiY21hdGgsanNvbix4bWwsZnBtLGludGwsemlwLGltYXAsZGV2ZWx9CiNpbnN0YWxsIGltYWdpY2sgZXh0ZW5zaW9uCnl1bSAteSBpbnN0YWxsIGdjYyBJbWFnZU1hZ2ljayBJbWFnZU1hZ2ljay1kZXZlbCBJbWFnZU1hZ2ljay1wZXJsCnBlY2wgaW5zdGFsbCBpbWFnaWNrCmNobW9kIDc1NSAvdXNyL2xpYjY0L3BocC9tb2R1bGVzL2ltYWdpY2suc28KY2F0IDw8RU9GID4+L2V0Yy9waHAuZC8yMC1pbWFnaWNrLmluaQoKZXh0ZW5zaW9uPWltYWdpY2sKCkVPRgoKc3lzdGVtY3RsIHJlc3RhcnQgcGhwLWZwbS5zZXJ2aWNlCgpzeXN0ZW1jdGwgc3RhcnQgIGh0dHBkCgp1c2VybW9kIC1hIC1HIGFwYWNoZSBlYzItdXNlcgpjaG93biAtUiBlYzItdXNlcjphcGFjaGUgL3Zhci93d3cKZmluZCAvdmFyL3d3dyAtdHlwZSBkIC1leGVjIGNobW9kIDI3NzUge30gXDsKZmluZCAvdmFyL3d3dyAtdHlwZSBmIC1leGVjIGNobW9kIDA2NjQge30gXDsKCgoKY3VybCAtTyBodHRwczovL3Jhdy5naXRodWJ1c2VyY29udGVudC5jb20vd3AtY2xpL2J1aWxkcy9naC1wYWdlcy9waGFyL3dwLWNsaS5waGFyCmNobW9kICt4IHdwLWNsaS5waGFyCm12IHdwLWNsaS5waGFyIC91c3IvbG9jYWwvYmluL3dwCndwIGNvcmUgZG93bmxvYWQgLS1wYXRoPS92YXIvd3d3L2h0bWwgLS1hbGxvdy1yb290CndwIGNvbmZpZyBjcmVhdGUgLS1kYm5hbWU9JGRiX25hbWUgLS1kYnVzZXI9JGRiX3VzZXJuYW1lIC0tZGJwYXNzPSRkYl91c2VyX3Bhc3N3b3JkIC0tZGJob3N0PSRkYl9lbmRwb2ludCAtLXBhdGg9L3Zhci93d3cvaHRtbCAtLWFsbG93LXJvb3QgLS1leHRyYS1waHAgPDxQSFAKZGVmaW5lKCAnRlNfTUVUSE9EJywgJ2RpcmVjdCcgKTsKZGVmaW5lKCdXUF9NRU1PUllfTElNSVQnLCAnMTI4TScpOwpQSFAKCmNob3duIC1SIGVjMi11c2VyOmFwYWNoZSAvdmFyL3d3dy9odG1sCmNobW9kIC1SIDc3NCAvdmFyL3d3dy9odG1sCgpzZWQgLWkgJy88RGlyZWN0b3J5ICJcL3Zhclwvd3d3XC9odG1sIj4vLC88XC9EaXJlY3Rvcnk+LyBzL0FsbG93T3ZlcnJpZGUgTm9uZS9BbGxvd092ZXJyaWRlIGFsbC8nIC9ldGMvaHR0cGQvY29uZi9odHRwZC5jb25mCnN5c3RlbWN0bCBlbmFibGUgIGh0dHBkLnNlcnZpY2UKc3lzdGVtY3RsIHJlc3RhcnQgaHR0cGQuc2VydmljZQplY2hvIFdvcmRQcmVzcyBJbnN0YWxsZWQ="
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination      = "true"
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 20
              + volume_type                = "gp3"
            }
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "prod"
              + "ManagedBy"   = "ASG"
              + "Name"        = "cloudpro-vpc-asg-instance"
              + "Project"     = "cloudpro-vpc"
            }
        }
    }

  # aws_lb.wordpress will be created
  + resource "aws_lb" "wordpress" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "cloudpro-vpc-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-1"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "cloudpro-vpc-alb"
        }
      + tags_all                                                     = {
          + "Name" = "cloudpro-vpc-alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.wordpress_http will be created
  + resource "aws_lb_listener" "wordpress_http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name" = "cloudpro-vpc-http-listener"
        }
      + tags_all                                                              = {
          + "Name" = "cloudpro-vpc-http-listener"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication {
          + advertise_trust_store_ca_names   = (known after apply)
          + ignore_client_certificate_expiry = (known after apply)
          + mode                             = (known after apply)
          + trust_store_arn                  = (known after apply)
        }
    }

  # aws_lb_target_group.wordpress will be created
  + resource "aws_lb_target_group" "wordpress" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "cloudpro-vpc-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-1"
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "cloudpro-vpc-target-group"
        }
      + tags_all                           = {
          + "Name" = "cloudpro-vpc-target-group"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_group_health {
          + dns_failover {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }

          + unhealthy_state_routing {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

  # aws_nat_gateway.main[0] will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + auto_provision_zones               = (known after apply)
      + auto_scaling_ips                   = (known after apply)
      + availability_mode                  = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-1"
      + regional_nat_gateway_address       = (known after apply)
      + regional_nat_gateway_auto_mode     = (known after apply)
      + route_table_id                     = (known after apply)
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "cloudpro-vpc-us-east-1a-nat-gtw"
        }
      + tags_all                           = {
          + "Name" = "cloudpro-vpc-us-east-1a-nat-gtw"
        }
      + vpc_id                             = (known after apply)
    }

  # aws_network_acl.database will be created
  + resource "aws_network_acl" "database" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 200
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + region     = "us-east-1"
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "cloudpro-vpc-databases"
        }
      + tags_all   = {
          + "Name" = "cloudpro-vpc-databases"
        }
      + vpc_id     = (known after apply)
    }

  # aws_network_acl_association.database[0] will be created
  + resource "aws_network_acl_association" "database" {
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + region         = "us-east-1"
      + subnet_id      = (known after apply)
    }

  # aws_network_acl_rule.allow_3306[0] will be created
  + resource "aws_network_acl_rule" "allow_3306" {
      + cidr_block     = "10.0.3.0/24"
      + egress         = false
      + from_port      = 3306
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + region         = "us-east-1"
      + rule_action    = "allow"
      + rule_number    = 10
      + to_port        = 3306
    }

  # aws_network_acl_rule.allow_6379[0] will be created
  + resource "aws_network_acl_rule" "allow_6379" {
      + cidr_block     = "10.0.3.0/24"
      + egress         = false
      + from_port      = 6379
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + region         = "us-east-1"
      + rule_action    = "allow"
      + rule_number    = 20
      + to_port        = 6379
    }

  # aws_network_acl_rule.deny will be created
  + resource "aws_network_acl_rule" "deny" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + region         = "us-east-1"
      + rule_action    = "deny"
      + rule_number    = 300
      + to_port        = 0
    }

  # aws_route.private[0] will be created
  + resource "aws_route" "private" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route53_health_check.wordpress[0] will be created
  + resource "aws_route53_health_check" "wordpress" {
      + arn                             = (known after apply)
      + cloudwatch_alarm_name           = "cloudpro-vpc-wordpress-health"
      + cloudwatch_alarm_region         = "us-east-1"
      + disabled                        = false
      + enable_sni                      = (known after apply)
      + failure_threshold               = 3
      + fqdn                            = "wordpress.fabiodev.com"
      + id                              = (known after apply)
      + insufficient_data_health_status = "Unhealthy"
      + measure_latency                 = false
      + port                            = 80
      + request_interval                = 30
      + resource_path                   = "/"
      + tags                            = {
          + "Domain"      = "wordpress.fabiodev.com"
          + "Environment" = "prod"
          + "Issue"       = "15"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "cloudpro-vpc-wordpress-health-check"
        }
      + tags_all                        = {
          + "Domain"      = "wordpress.fabiodev.com"
          + "Environment" = "prod"
          + "Issue"       = "15"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "cloudpro-vpc-wordpress-health-check"
        }
      + triggers                        = (known after apply)
      + type                            = "HTTP"
    }

  # aws_route53_health_check.wordpress_www[0] will be created
  + resource "aws_route53_health_check" "wordpress_www" {
      + arn                             = (known after apply)
      + cloudwatch_alarm_name           = "cloudpro-vpc-wordpress-www-health"
      + cloudwatch_alarm_region         = "us-east-1"
      + disabled                        = false
      + enable_sni                      = (known after apply)
      + failure_threshold               = 3
      + fqdn                            = "www.wordpress.fabiodev.com"
      + id                              = (known after apply)
      + insufficient_data_health_status = "Unhealthy"
      + measure_latency                 = false
      + port                            = 80
      + request_interval                = 30
      + resource_path                   = "/"
      + tags                            = {
          + "Domain"      = "www.wordpress.fabiodev.com"
          + "Environment" = "prod"
          + "Issue"       = "15"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "cloudpro-vpc-wordpress-www-health-check"
        }
      + tags_all                        = {
          + "Domain"      = "www.wordpress.fabiodev.com"
          + "Environment" = "prod"
          + "Issue"       = "15"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "cloudpro-vpc-wordpress-www-health-check"
        }
      + triggers                        = (known after apply)
      + type                            = "HTTP"
    }

  # aws_route53_record.wordpress will be created
  + resource "aws_route53_record" "wordpress" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "wordpress.fabiodev.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.wordpress_www will be created
  + resource "aws_route53_record" "wordpress_www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.wordpress.fabiodev.com"
      + records         = [
          + "wordpress.fabiodev.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.main will be created
  + resource "aws_route53_zone" "main" {
      + arn                         = (known after apply)
      + comment                     = "Hosted zone para fabiodev.com - WordPress Infrastructure"
      + enable_accelerated_recovery = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + name                        = "fabiodev.com"
      + name_servers                = (known after apply)
      + primary_name_server         = (known after apply)
      + tags                        = {
          + "Domain"      = "fabiodev.com"
          + "Environment" = "prod"
          + "Issue"       = "15"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "cloudpro-vpc-hosted-zone"
          + "Project"     = "cloudpro-vpc"
        }
      + tags_all                    = {
          + "Domain"      = "fabiodev.com"
          + "Environment" = "prod"
          + "Issue"       = "15"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "cloudpro-vpc-hosted-zone"
          + "Project"     = "cloudpro-vpc"
        }
      + zone_id                     = (known after apply)
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Name" = "cloudpro-vpc-private-1-rtb"
        }
      + tags_all         = {
          + "Name" = "cloudpro-vpc-private-1-rtb"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_internet_access will be created
  + resource "aws_route_table" "public_internet_access" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Name" = "cloudpro-vpc-public-access"
        }
      + tags_all         = {
          + "Name" = "cloudpro-vpc-public-access"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group para Application Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "HTTP to WordPress instances"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "HTTPS to WordPress instances"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "cloudpro-vpc-alb-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "cloudpro-vpc-alb-sg"
        }
      + tags_all               = {
          + "Name" = "cloudpro-vpc-alb-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS MySQL database"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "MySQL from WordPress EC2"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "cloudpro-vpc-rds-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc-rds-sg"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc-rds-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.wordpress_basic will be created
  + resource "aws_security_group" "wordpress_basic" {
      + arn                    = (known after apply)
      + description            = "Security group basico para instancia WordPress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Saida para internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "MySQL para RDS"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "NFS para EFS"
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2049
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "SSH interno da VPC"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTP do ALB"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTPS do ALB"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "cloudpro-vpc-wordpress-basic-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "cloudpro-vpc-wordpress-basic-sg"
        }
      + tags_all               = {
          + "Name" = "cloudpro-vpc-wordpress-basic-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_ssm_parameter.db_endpoint will be created
  + resource "aws_ssm_parameter" "db_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/cloudpro-vpc/rds/endpoint"
      + region         = "us-east-1"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc-db-endpoint"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc-db-endpoint"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.db_password will be created
  + resource "aws_ssm_parameter" "db_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/cloudpro-vpc/rds/password"
      + region         = "us-east-1"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc-db-password"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc-db-password"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.db_username will be created
  + resource "aws_ssm_parameter" "db_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/cloudpro-vpc/rds/username"
      + region         = "us-east-1"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc-db-username"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "Name"        = "cloudpro-vpc-db-username"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_subnet.database_subnets[0] will be created
  + resource "aws_subnet" "database_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name" = "private-2"
        }
      + tags_all                                       = {
          + "Name" = "private-2"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region   

... (output truncated)
```

</details>

**Plan Status:** success

*Pusher: @fabiomartinsbrrj, Action: `pull_request`*